## Plan Result (Sandbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.prod-internal.azurerm_dns_zone.zone
  * module.prod-internal.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prod-internal.azurerm_dns_zone.zone must be replaced
-/+ resource "azurerm_dns_zone" "zone" {
      ~ id                        = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/frontdoor.sandbox.hmcts.net" -> (known after apply)
      ~ max_number_of_record_sets = 10000 -> (known after apply)
      ~ name                      = "frontdoor.sandbox.hmcts.net" -> "frontdoor.sandbox.platform.hmcts.net" # forces replacement
      ~ name_servers              = [
          - "ns1-32.azure-dns.com.",
          - "ns2-32.azure-dns.net.",
          - "ns3-32.azure-dns.org.",
          - "ns4-32.azure-dns.info.",
        ] -> (known after apply)
      ~ number_of_record_sets     = 2 -> (known after apply)
      - tags                      = {} -> null
        # (1 unchanged attribute hidden)

      - soa_record {
          - email         = "azuredns-hostmaster.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "frontdoor.sandbox.hmcts.net." -> null
          - host_name     = "ns1-32.azure-dns.com." -> null
          - minimum_ttl   = 300 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.prod-internal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/frontdoor.sandbox.hmcts.net/providers/Microsoft.Authorization/roleAssignments/e95007f8-1233-f4f9-84e6-aa0d26f4443c" -> (known after apply)
      ~ name                             = "e95007f8-1233-f4f9-84e6-aa0d26f4443c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/frontdoor.sandbox.hmcts.net" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1369,"Program":"tfcmt","SHA1":"","Target":"Sandbox","Vars":{}} -->